---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_ElementNodeIsNotPartOfNetwork
source: html/828d0861-9b99-1092-4828-215847d82b85.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_ElementNodeIsNotPartOfNetwork Property

The calculation could not be executed as configured. At least one of the elements in this network uses a node that is not part of the network.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_ElementNodeIsNotPartOfNetwork { get; }
```